#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
random_password.flyte_db_password: Refreshing state... [id=none]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
data.google_client_config.default: Reading...
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster]
google_container_node_pool.flyte_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster/nodePools/flyte-np]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.0.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "34.74.168.77" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.3.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRUEJnYlpCZVRaMUJkMGg5Z0RYbGdVekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNU1EQTNNbVUwT1MxaFpXRTNMVFE0TUdNdFlUazBZaTFtWlRRelpESXpObVE0TnpjdwpJQmNOTWpNd056RTBNakkwTlRVeldoZ1BNakExTXpBM01EWXlNelExTlROYU1DOHhMVEFyQmdOVkJBTVRKRGt3Ck1EY3laVFE1TFdGbFlUY3RORGd3WXkxaE9UUmlMV1psTkROa01qTTJaRGczTnpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQUtHV3E1RDNLcVVlbVNPbDB0cGIzQm11M1lSODBZNW1kUXAxaC9GTApaSjl2aWcybXk2NTNKbld3L0VPdjVGWjF5emtVUlcwT2NvM2lrWUhpRUNKQTFhK1dnODVGK1NJazJmUWxhWFhxCkx3SmoySnppNUJ2RWw0ZUFvMmdNbVQwSXpSUUdtbVdWb2xOYWM4dWdLZ1NqcXlseVVvcTRSR25GaEUxcmpycmQKRmNzSWk5NENYSXZhakp2TGY0Ly9tSmg5NjdjaFNvY1FIN0cxY0dsNWZUdkZScStMSndoSkFjWjBod2hHb1E3TAp0UUx0cHl3ZVBiWjE2bEo5RDRydkhrbElMRVJobU9PYWhvclFRSHdYN2lLVy9MS3ZjNlR0b3VRZThnWXcraTR1ClIzbGtycjhIOWJOUlRvRk1DY2V6RmI1NlVaUTl4T2tUVlJ2ekZTeEl5ZldQUkVmbWlrdkhhdTRuZC8xR2J6OWUKK2dNbFNwZzVnVGpxM003YnA0V1J6cFo4dXRTYWUwcFdwRU0rWDRMNTZFN2k2eVZUUklhdG8vQVdWVG9PQkk2ZQpsU2dlZ1EvSU83d2lsdTdyRlZLK0JtclNMY0dJVmwxSTFkbHltQVgxZ0dhSVg1alFKU3FjRS8xT21qY3crVEw1CjJycjFmdEhzMURzSThnNnJnR05paGtUV3pRSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVViMWI3bTZzRENYOHhjdWk4VDhzTnpxMytoK013RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFBM21tRnV5WkVkZG5oWmF3bE94RWppODEzczZnbk5CeTJhQm9CSEFtYno5CmtySzhZempmQnN1V2ozaGdHUFZ5ZzNWRks3djMraUIwZkJVc1pNL0pQNmdsZitMenZBS0NESkJGK1cvWmE1V3oKUVFhSWxvNmIyeHJwdmZ2Z2xqNkV2Y1ZPVW8xUStjQmdHS2w1dHlneDU3MkhBUC9DNnN3MXJUODF4UVRoTGZDMwpVVzFZcDV5ZVBOUndmSk9ZTXVFaW12dnhQSmRmZVNqMUdrOUk3cXc3cXlJUFlMZGJuNCtBamVhZFNPZDduSUtUClg4MCt4bldNRnlyeDhiQ25uem9VNUgzSnpJUjNZMnc4dCtITU9zaVhHOGVIK2hEdVQwcklEdlIrWjdEeFdPOFUKL3ZrR1JQT3dadzhsYmpZQ3Y5Qng5YlNFQitpTmFhMThBcVU3cFIzR0lHUU5oTnFqMGJGQ2owQkVGeHVWTllWbwpWcy9ra0xwTktVU1V5RDY3SmRmUjRIV29KU0F3SUVqVFZwc2V3RVBhRXZHZTQwN001eW9tVlI0UzIveW8vR3BPCndoNml2YXdzSk1TcGJvbVpNZVo1Zmx5b3J1QlVvVXl1OVJINlNFbDlZdEF2Wit6Uk9oMFRacmxWSGJpcU9ZY00KTWk2cUFEbWN5Y2Z2bGZPaUJhRzExQT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      + node_config { # forces replacement
          + disk_size_gb      = 10 # forces replacement
          + disk_type         = "pd-balanced" # forces replacement
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false # forces replacement
          + service_account   = (known after apply)
          + spot              = false # forces replacement
          + taint             = (known after apply)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.41" -> null
          - public_endpoint         = "34.74.168.77" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.flyte_node_pool will be created
  + resource "google_container_node_pool" "flyte_node_pool" {
      + cluster                     = "flyte-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1-b"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "flyte-np"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-micro"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # helm_release.flyte_single_cluster will be created
  + resource "helm_release" "flyte_single_cluster" {
      + atomic                     = false
      + chart                      = "flyte-binary"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flyte-test-setup"
      + namespace                  = "flyte"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flyteorg.github.io/flyte"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.8.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*